In [8]:
import pandas as pd
# reading .csv file
df1 = pd.read_csv("../data/supermarkets/supermarkets.csv")
df1

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [11]:
# if we want to read an excel we need to have the next dependences installed:

# python3 -m pip install openpyxl
# python3 -m pip install xlrd

df2 = pd.read_excel("../data/supermarkets/supermarkets.xlsx", sheet_name=0)
df2

,ID,Address,City,State,Country,Supermarket Name,Number of Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [12]:
# reading .json file
df3 = pd.read_json("../data/supermarkets/supermarkets.json")
df3

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [ ]:
# reading .txt separated with comas. In this case we use also read.csv because it's exactly the same format
df4 = pd.read_csv("../data/supermarkets/supermarkets-commas.txt")
df4

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [15]:
# reading .txt separated with semi-colons. In this case we should specify the separator with the parameter sep=";"
df5 = pd.read_csv("../data/supermarkets/supermarkets-semi-colons.txt",sep=";")
df5

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [31]:
# if we want to quit the header name we do the next thing 
df6 = pd.read_csv("../data/supermarkets/data.csv", header=None)
df6

   0                1              2                 3    4            5   6
0  1     3666 21st St  San Francisco          CA 94114  USA      Madeira   8
1  2   735 Dolores St  San Francisco          CA 94119  USA  Bready Shop  15
2  3      332 Hill St  San Francisco  California 94114  USA  Super River  25
3  4     3995 23rd St  San Francisco          CA 94114  USA   Ben's Shop  10
4  5  1056 Sanchez St  San Francisco        California  USA      Sanchez  12
5  6  551 Alvarado St  San Francisco          CA 94114  USA   Richvalley  20

In [29]:
# if we want add the name of a data frame header we do this
# this show double header because in the original file it was the header
df6.columns = ["ID", "Address", "City", "State", "Country", "Name", "Employees"]
df6

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [54]:
# to set the correct value of an index, in this case the column ID, we do this
df7 = pd.read_csv("../data/supermarkets/supermarkets.csv",index_col="ID")
df7

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [67]:
# if we want to filter one portion of the info, we do this with the .loc
df7.loc[2:3,"Country":"Employees"]

   Country         Name  Employees
ID
2      USA  Bready Shop         15
3      USA  Super River         25

In [65]:
# if we want to get only one value we should do this
df7.loc[1,"Address"]

'3666 21st St'

In [69]:
# if we want to get all values of a column we should do this
list(df7.loc[:,"Address"])

['3666 21st St',
 '735 Dolores St',
 '332 Hill St',
 '3995 23rd St',
 '1056 Sanchez St',
 '551 Alvarado St']

In [76]:
# access by indexing using iloc
df7.iloc[0:2,3:]

   Country         Name  Employees
ID
1      USA      Madeira          8
2      USA  Bready Shop         15

In [94]:
# delete the column "City"
df7.drop("Address", axis=1, inplace=True)
df7

               State Country         Name  Employees
ID
3   California 94114     USA  Super River         25
4           CA 94114     USA   Ben's Shop         10
5         California     USA      Sanchez         12
6           CA 94114     USA   Richvalley         20

In [91]:
# delete the row with index 1
df7.drop(1, axis=0, inplace=True)
df7

            Address             State Country         Name  Employees
ID
3       332 Hill St  California 94114     USA  Super River         25
4      3995 23rd St          CA 94114     USA   Ben's Shop         10
5   1056 Sanchez St        California     USA      Sanchez         12
6   551 Alvarado St          CA 94114     USA   Richvalley         20

               State Country         Name  Employees
ID
3   California 94114     USA  Super River         25
4           CA 94114     USA   Ben's Shop         10
5         California     USA      Sanchez         12
6           CA 94114     USA   Richvalley         20

In [96]:
# adding new rows
df7["Continent"]=df7.shape[0]*["North America"]

In [97]:
df7

               State Country         Name  Employees      Continent
ID
3   California 94114     USA  Super River         25  North America
4           CA 94114     USA   Ben's Shop         10  North America
5         California     USA      Sanchez         12  North America
6           CA 94114     USA   Richvalley         20  North America

In [98]:
# adding new column
df7["Continent"]=df7["Country"]+","+["North America"]

In [99]:
df7

               State Country         Name  Employees          Continent
ID
3   California 94114     USA  Super River         25  USA,North America
4           CA 94114     USA   Ben's Shop         10  USA,North America
5         California     USA      Sanchez         12  USA,North America
6           CA 94114     USA   Richvalley         20  USA,North America

In [101]:
# if we want to add a new row we do this
df7.loc[4]=[ "New York", "USA", "Newark Shop", 10, "USA,North America"]
df7

               State Country         Name  Employees          Continent
ID
3   California 94114     USA  Super River         25  USA,North America
4           New York     USA  Newark Shop         10  USA,North America
5         California     USA      Sanchez         12  USA,North America
6           CA 94114     USA   Richvalley         20  USA,North America